espressif/esp-idf/components/soc/esp32c6/register/soc/twai_reg.h
/** TWAI_ERR_CODE_CAP_REG register
 *  TWAI error info capture register.
 */
#define TWAI_ERR_CODE_CAP_REG(i) (REG_TWAI_BASE(i) + 0x30)
/** TWAI_ERR_CAPTURE_CODE_SEGMENT : RO; bitpos: [4:0]; default: 0;
 *  This register contains information about the location of errors on the bus.
 */
#define TWAI_ERR_CAPTURE_CODE_SEGMENT    0x0000001FU
#define TWAI_ERR_CAPTURE_CODE_SEGMENT_M  (TWAI_ERR_CAPTURE_CODE_SEGMENT_V << TWAI_ERR_CAPTURE_CODE_SEGMENT_S)
#define TWAI_ERR_CAPTURE_CODE_SEGMENT_V  0x0000001FU
#define TWAI_ERR_CAPTURE_CODE_SEGMENT_S  0
/** TWAI_ERR_CAPTURE_CODE_DIRECTION : RO; bitpos: [5]; default: 0;
 *  1: RX, error occurred during reception. 0: TX, error occurred during transmission.
 */
#define TWAI_ERR_CAPTURE_CODE_DIRECTION    (BIT(5))
#define TWAI_ERR_CAPTURE_CODE_DIRECTION_M  (TWAI_ERR_CAPTURE_CODE_DIRECTION_V << TWAI_ERR_CAPTURE_CODE_DIRECTION_S)
#define TWAI_ERR_CAPTURE_CODE_DIRECTION_V  0x00000001U
#define TWAI_ERR_CAPTURE_CODE_DIRECTION_S  5
/** TWAI_ERR_CAPTURE_CODE_TYPE : RO; bitpos: [7:6]; default: 0;
 *  00: bit error. 01: form error. 10:stuff error. 11:other type of error.
 */
#define TWAI_ERR_CAPTURE_CODE_TYPE    0x00000003U
#define TWAI_ERR_CAPTURE_CODE_TYPE_M  (TWAI_ERR_CAPTURE_CODE_TYPE_V << TWAI_ERR_CAPTURE_CODE_TYPE_S)
#define TWAI_ERR_CAPTURE_CODE_TYPE_V  0x00000003U
#define TWAI_ERR_CAPTURE_CODE_TYPE_S  6

/** TWAI_ERR_WARNING_LIMIT_REG register
 *  TWAI error threshold configuration register.
 */
#define TWAI_ERR_WARNING_LIMIT_REG(i) (REG_TWAI_BASE(i) + 0x34)
/** TWAI_ERR_WARNING_LIMIT : R/W; bitpos: [7:0]; default: 96;
 *  The threshold that trigger error warning interrupt when this interrupt is enabled.
 *  Software has R/W permission in reset mode and RO in operation mode.
 */
#define TWAI_ERR_WARNING_LIMIT    0x000000FFU
#define TWAI_ERR_WARNING_LIMIT_M  (TWAI_ERR_WARNING_LIMIT_V << TWAI_ERR_WARNING_LIMIT_S)
#define TWAI_ERR_WARNING_LIMIT_V  0x000000FFU
#define TWAI_ERR_WARNING_LIMIT_S  0

/** TWAI_RX_ERR_CNT_REG register
 *  Rx error counter register.
 */
#define TWAI_RX_ERR_CNT_REG(i) (REG_TWAI_BASE(i) + 0x38)
/** TWAI_RX_ERR_CNT : R/W; bitpos: [7:0]; default: 0;
 *  The RX error counter register reflects the current value of the transmit error
 *  counter. Software has R/W permission in reset mode and RO in operation mode.
 */
#define TWAI_RX_ERR_CNT    0x000000FFU
#define TWAI_RX_ERR_CNT_M  (TWAI_RX_ERR_CNT_V << TWAI_RX_ERR_CNT_S)
#define TWAI_RX_ERR_CNT_V  0x000000FFU
#define TWAI_RX_ERR_CNT_S  0

/** TWAI_TX_ERR_CNT_REG register
 *  Tx error counter register.
 */
#define TWAI_TX_ERR_CNT_REG(i) (REG_TWAI_BASE(i) + 0x3c)
/** TWAI_TX_ERR_CNT : R/W; bitpos: [7:0]; default: 0;
 *  The TX error counter register reflects the current value of the transmit error
 *  counter. Software has R/W permission in reset mode and RO in operation mode.
 */
#define TWAI_TX_ERR_CNT    0x000000FFU
#define TWAI_TX_ERR_CNT_M  (TWAI_TX_ERR_CNT_V << TWAI_TX_ERR_CNT_S)
#define TWAI_TX_ERR_CNT_V  0x000000FFU
#define TWAI_TX_ERR_CNT_S  0

/** TWAI_DATA_0_REG register
 *  Data register 0.
 */
#define TWAI_DATA_0_REG(i) (REG_TWAI_BASE(i) + 0x40)
/** TWAI_DATA_0 : R/W; bitpos: [7:0]; default: 0;
 *  In reset mode, it is acceptance code register 0 with R/W Permission. In operation
 *  mode, when software initiate write operation, it is tx data register 0 and when
 *  software initiate read operation, it is rx data register 0.
 */
#define TWAI_DATA_0    0x000000FFU
#define TWAI_DATA_0_M  (TWAI_DATA_0_V << TWAI_DATA_0_S)
#define TWAI_DATA_0_V  0x000000FFU
#define TWAI_DATA_0_S  0

/** TWAI_DATA_1_REG register
 *  Data register 1.
 */
#define TWAI_DATA_1_REG(i) (REG_TWAI_BASE(i) + 0x44)
/** TWAI_DATA_1 : R/W; bitpos: [7:0]; default: 0;
 *  In reset mode, it is acceptance code register 1 with R/W Permission. In operation
 *  mode, when software initiate write operation, it is tx data register 1 and when
 *  software initiate read operation, it is rx data register 1.
 */
#define TWAI_DATA_1    0x000000FFU
#define TWAI_DATA_1_M  (TWAI_DATA_1_V << TWAI_DATA_1_S)
#define TWAI_DATA_1_V  0x000000FFU
#define TWAI_DATA_1_S  0

/** TWAI_DATA_2_REG register
 *  Data register 2.
 */
#define TWAI_DATA_2_REG(i) (REG_TWAI_BASE(i) + 0x48)
/** TWAI_DATA_2 : R/W; bitpos: [7:0]; default: 0;
 *  In reset mode, it is acceptance code register 2 with R/W Permission. In operation
 *  mode, when software initiate write operation, it is tx data register 2 and when
 *  software initiate read operation, it is rx data register 2.
 */
#define TWAI_DATA_2    0x000000FFU
#define TWAI_DATA_2_M  (TWAI_DATA_2_V << TWAI_DATA_2_S)
#define TWAI_DATA_2_V  0x000000FFU
#define TWAI_DATA_2_S  0

/** TWAI_DATA_3_REG register
 *  Data register 3.
 */
#define TWAI_DATA_3_REG(i) (REG_TWAI_BASE(i) + 0x4c)
/** TWAI_DATA_3 : R/W; bitpos: [7:0]; default: 0;
 *  In reset mode, it is acceptance code register 3 with R/W Permission. In operation
 *  mode, when software initiate write operation, it is tx data register 3 and when
 *  software initiate read operation, it is rx data register 3.
 */
#define TWAI_DATA_3    0x000000FFU
#define TWAI_DATA_3_M  (TWAI_DATA_3_V << TWAI_DATA_3_S)
#define TWAI_DATA_3_V  0x000000FFU
#define TWAI_DATA_3_S  0

/** TWAI_DATA_4_REG register
 *  Data register 4.
 */
#define TWAI_DATA_4_REG(i) (REG_TWAI_BASE(i) + 0x50)
/** TWAI_DATA_4 : R/W; bitpos: [7:0]; default: 0;
 *  In reset mode, it is acceptance mask register 0 with R/W Permission. In operation
 *  mode, when software initiate write operation, it is tx data register 4 and when
 *  software initiate read operation, it is rx data register 4.
 */
#define TWAI_DATA_4    0x000000FFU
#define TWAI_DATA_4_M  (TWAI_DATA_4_V << TWAI_DATA_4_S)
#define TWAI_DATA_4_V  0x000000FFU
#define TWAI_DATA_4_S  0

/** TWAI_DATA_5_REG register
 *  Data register 5.
 */
#define TWAI_DATA_5_REG(i) (REG_TWAI_BASE(i) + 0x54)
/** TWAI_DATA_5 : R/W; bitpos: [7:0]; default: 0;
 *  In reset mode, it is acceptance mask register 1 with R/W Permission. In operation
 *  mode, when software initiate write operation, it is tx data register 5 and when
 *  software initiate read operation, it is rx data register 5.
 */
#define TWAI_DATA_5    0x000000FFU
#define TWAI_DATA_5_M  (TWAI_DATA_5_V << TWAI_DATA_5_S)
#define TWAI_DATA_5_V  0x000000FFU
#define TWAI_DATA_5_S  0

/** TWAI_DATA_6_REG register
 *  Data register 6.
 */
#define TWAI_DATA_6_REG(i) (REG_TWAI_BASE(i) + 0x58)
/** TWAI_DATA_6 : R/W; bitpos: [7:0]; default: 0;
 *  In reset mode, it is acceptance mask register 2 with R/W Permission. In operation
 *  mode, when software initiate write operation, it is tx data register 6 and when
 *  software initiate read operation, it is rx data register 6.
 */
#define TWAI_DATA_6    0x000000FFU
#define TWAI_DATA_6_M  (TWAI_DATA_6_V << TWAI_DATA_6_S)
#define TWAI_DATA_6_V  0x000000FFU
#define TWAI_DATA_6_S  0

/** TWAI_DATA_7_REG register
 *  Data register 7.
 */
#define TWAI_DATA_7_REG(i) (REG_TWAI_BASE(i) + 0x5c)
/** TWAI_DATA_7 : R/W; bitpos: [7:0]; default: 0;
 *  In reset mode, it is acceptance mask register 3 with R/W Permission. In operation
 *  mode, when software initiate write operation, it is tx data register 7 and when
 *  software initiate read operation, it is rx data register 7.
 */
#define TWAI_DATA_7    0x000000FFU
#define TWAI_DATA_7_M  (TWAI_DATA_7_V << TWAI_DATA_7_S)
#define TWAI_DATA_7_V  0x000000FFU
#define TWAI_DATA_7_S  0

/** TWAI_DATA_8_REG register
 *  Data register 8.
 */
#define TWAI_DATA_8_REG(i) (REG_TWAI_BASE(i) + 0x60)
/** TWAI_DATA_8 : R/W; bitpos: [7:0]; default: 0;
 *  In reset mode, reserved with RO. In operation mode, when software initiate write
 *  operation, it is tx data register 8 and when software initiate read operation, it
 *  is rx data register 8.
 */
#define TWAI_DATA_8    0x000000FFU
#define TWAI_DATA_8_M  (TWAI_DATA_8_V << TWAI_DATA_8_S)
#define TWAI_DATA_8_V  0x000000FFU
#define TWAI_DATA_8_S  0

/** TWAI_DATA_9_REG register
 *  Data register 9.
 */
#define TWAI_DATA_9_REG(i) (REG_TWAI_BASE(i) + 0x64)
/** TWAI_DATA_9 : R/W; bitpos: [7:0]; default: 0;
 *  In reset mode, reserved with RO. In operation mode, when software initiate write
 *  operation, it is tx data register 9 and when software initiate read operation, it
 *  is rx data register 9.
 */
#define TWAI_DATA_9    0x000000FFU
#define TWAI_DATA_9_M  (TWAI_DATA_9_V << TWAI_DATA_9_S)
#define TWAI_DATA_9_V  0x000000FFU
#define TWAI_DATA_9_S  0

